; domain
(define (domain two_enemies_domain)

    (:types
        location
        enemy
    )

    (:predicates
        (enemy_loc ?enemy - enemy ?loc - location)
        (con ?from ?to - location)          ; locations are connected
        (wall ?loc1 ?loc2 - location)       ; wall between locations
        (blocked ?loc - location)           ; location is blocked - agent cannot go there
        (wall-trigger ?trigger ?loc1 ?loc2) ; location is a trigger that creates wall between loc1 and loc2
        (reverse-wall-trigger ?trigger ?loc1 ?loc2) ; location is a trigger that deactivates wall between loc1 and loc2
    )

    (:action move
        :parameters (?from ?to - location ?e - enemy)
        :precondition (and (not (blocked ?to)) (or (con ?from ?to) (con ?to ?from)) (enemy_loc ?e ?from) (not (or (wall ?from ?to) (wall ?to ?from))) )
        :effect (and 
            (enemy_loc ?e ?to)
            (not (enemy_loc ?e ?from))
            (forall (?loc1 ?loc2 - location)
                (and
                    (when (or (wall-trigger ?to ?loc1 ?loc2) (wall-trigger ?to ?loc2 ?loc1))
                        (and (wall ?loc1 ?loc2) (wall ?loc2 ?loc1))
                    )
                    (when (or (reverse-wall-trigger ?to ?loc1 ?loc2) (reverse-wall-trigger ?to ?loc2 ?loc1))
                        (and (not(wall ?loc1 ?loc2)) (not(wall ?loc2 ?loc1)))
                    )
                )
            )
        )
    )
)

; problem
(define (problem two_enemies_problem)

    (:domain two_enemies_domain)
    
    (:objects
        a4 b4 c4 d4
        a3 b3 c3 d3
        a2 b2 c2 d2
        a1 b1 c1 d1 - location
        en1 en2 - enemy
    )
    
    (:init 
        (enemy_loc en1 b1)
        (enemy_loc en2 d1)
        
        (con a4 b4) (con b4 c4) (con c4 d4)
        (con a3 b3) (con b3 c3) (con c3 d3)
        (con a2 b2) (con b2 c2) (con c2 d2)
        (con a1 b1) (con b1 c1) (con c1 d1)
        
        (con a4 a3) (con a3 a2) (con a2 a1)
        (con b4 b3) (con b3 b2) (con b2 b1)
        (con c4 c3) (con c3 c2) (con c2 c1)
        (con d4 d3) (con d3 d2) (con d2 d1)
        
        (blocked a2) (blocked b2) (blocked d2)
        
        (wall c1 c2)
        
        (reverse-wall-trigger a1 c1 c2)
    )
    
    (:goal
        (or
            (enemy_loc en1 a4) (enemy_loc en1 b4) (enemy_loc en1 c4) (enemy_loc en1 d4)
            (enemy_loc en2 a4) (enemy_loc en2 b4) (enemy_loc en2 c4) (enemy_loc en2 d4)
        )
    )

)

; plan
1. (move b1 a1 en1)
   deleted: (enemy_loc en1 b1) (wall c1 c2)
   added: (enemy_loc en1 a1)
   goals met: 0 of 1
2. (move d1 c1 en2)
   deleted: (enemy_loc en2 d1)
   added: (enemy_loc en2 c1)
   goals met: 0 of 1
3. (move c1 c2 en2)
   deleted: (enemy_loc en2 c1)
   added: (enemy_loc en2 c2)
   goals met: 0 of 1
4. (move c2 c3 en2)
   deleted: (enemy_loc en2 c2)
   added: (enemy_loc en2 c3)
   goals met: 0 of 1
5. (move c3 c4 en2)
   deleted: (enemy_loc en2 c3)
   added: (enemy_loc en2 c4)
   goals met: 1 of 1
